In [2]:
import pandas as pd
df = pd.read_csv('csv/decessi_tot.csv')

In [3]:
df.head()

         Data  Totale
0  2015-01-01     151
1  2015-01-02     160
2  2015-01-03     145
3  2015-01-04     153
4  2015-01-05     171

In [4]:
df['Data'] = pd.to_datetime(df['Data'])

In [5]:
df.index=df['Data']
df.head()

                 Data  Totale
Data
2015-01-01 2015-01-01     151
2015-01-02 2015-01-02     160
2015-01-03 2015-01-03     145
2015-01-04 2015-01-04     153
2015-01-05 2015-01-05     171

In [6]:
#raggruppo e sommo i decessi in base al mese
df = df.groupby(pd.Grouper(freq='M')).sum()

In [7]:
df.head()

            Totale
Data
2015-01-31    5026
2015-02-28    4662
2015-03-31    4285
2015-04-30    3907
2015-05-31    3788

In [8]:
df.to_csv('csv/decessi_mensili.csv')